app/views/allergy/_form.html.erb

SELECT `kids`.* FROM `kids`
---
		<%= f.label "kid"%>
		<%= select_tag("kid", options_from_collection_for_select(Kid.all, :id, :f_name) ) %>