app/views/parent/show.html.erb

		<td>
			<% Family.where(:parent_id => @parent.id).each do |f| %>
				<%= Kid.find_by(id: f.kid_id).f_name %>
---
SELECT `families`.* FROM `families`  WHERE `families`.`parent_id` = 12
SELECT  `kids`.* FROM `kids`  WHERE `kids`.`id` = 17 LIMIT 1