app/controllers/allergy_controller.rb

SELECT `allergies`.* FROM `allergies`
---
  def index
    @allergies= Allergy.all