app/controllers/families_controller.rb

DELETE FROM `families` WHERE `families`.`id` = ?  [["id", 18]]
---
	def destroy
    @family.destroy

SELECT  `families`.* FROM `families`  WHERE `families`.`id` = ? LIMIT 1  [["id", 18]]
---
	def set_family
		@family = Family.find(params[:id])