app/controllers/kid_controller.rb

SELECT `kids`.* FROM `kids`
---
  def index
    @kids = Kid.all

SELECT  `kids`.* FROM `kids`  WHERE `kids`.`id` = ? LIMIT 1  [["id", 8]]
---
  def edit
    @kid = Kid.find(params[:id])

SELECT  `families`.* FROM `families`  WHERE `families`.`is_primary` = 1 LIMIT 1
UPDATE `families` SET `is_primary` = ?, `updated_at` = ? WHERE `families`.`id` = 11  [["is_primary", 0], ["updated_at", "2015-04-24 15:22:45"]]
SELECT  `families`.* FROM `families`  WHERE `families`.`parent_id` = 7 AND `families`.`kid_id` = 13 LIMIT 1
---
	def change_primary_parent
		#update the primary parent to the newly passed parent id

		current_pm_p = Family.find_by(is_primary: true);
		current_pm_p.is_primary = false

		#hope that this works
		current_pm_p.save

		new_pm_p = Family.find_by(parent_id: params[:parent_id], kid_id: params[:id])

INSERT INTO `families` (`created_at`, `is_primary`, `kid_id`, `parent_id`, `updated_at`) VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-04-24 15:22:35"], ["is_primary", 0], ["kid_id", 13], ["parent_id", 7], ["updated_at", "2015-04-24 15:22:35"]]
---
	def add_parent
		new_pm_p = Family.create(parent_id: params[:parent_id], kid_id: params[:id], is_primary: false)

SELECT  `parents`.* FROM `parents`  WHERE `parents`.`id` = ? LIMIT 1  [["id", 1]]
SELECT  `allergies`.* FROM `allergies`  WHERE `allergies`.`id` = ? LIMIT 1  [["id", 1]]
INSERT INTO `kids` (`created_at`, `dob`, `f_name`, `first_date_attended`, `group`, `l_name`, `m_name`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO `families` (`created_at`, `kid_id`, `parent_id`, `updated_at`) VALUES (?, ?, ?, ?)  [["created_at", "2015-04-24 15:07:54"], ["kid_id", 4], ["parent_id", 1], ["updated_at", "2015-04-24 15:07:54"]]
INSERT INTO `allergics` (`allergy_id`, `created_at`, `kid_id`, `updated_at`) VALUES (?, ?, ?, ?)  [["allergy_id", 1], ["created_at", "2015-04-24 15:07:54"], ["kid_id", 4], ["updated_at", "2015-04-24 15:07:54"]]
---
  def create

    @kid_params_two=kid_params
    @kid_params_two[:dob]=DateTime.parse(@kid_params_two["dob"])
    @kid_params_two[:first_date_attended]=DateTime.parse(@kid_params_two[:first_date_attended])


	  @kid = Kid.new(@kid_params_two)
		@parent = Parent.find(params[:parent])
		@allergy = Allergy.find(params[:allergy])

    respond_to do |format|
		  if @kid.save
		    format.html { redirect_to @kid, notice: 'Kid was successfully created.' }
		    format.json { render :show, status: :created, location: @kid }
		  else
		    format.html { render :new }
		    format.json { render json: @kid.errors, status: :unprocessable_entity }
		  end
			Family.create(:kid => @kid, :parent => @parent)
			Allergic.create(:kid => @kid, :allergy => @allergy)

UPDATE `kids` SET `dob` = ?, `first_date_attended` = ?, `updated_at` = ? WHERE `kids`.`id` = 8  [["dob", "2015-04-24 00:00:00"], ["first_date_attended", "2015-04-24 00:00:00"], ["updated_at", "2015-04-24 15:14:04"]]
---
  def update
    #debugger
    @kid_params_two=kid_params
    @kid_params_two[:dob]=DateTime.parse(@kid_params_two["dob"])
    @kid_params_two[:first_date_attended]=DateTime.parse(@kid_params_two[:first_date_attended])


    respond_to do |format|
      if @kid.update(@kid_params_two)

DELETE FROM `kids` WHERE `kids`.`id` = ?  [["id", 12]]
---
  def destroy
    @kid.destroy

SELECT  `kids`.* FROM `kids`  WHERE `kids`.`id` = ? LIMIT 1  [["id", 10]]
INSERT INTO `attendances` (`created_at`, `date`, `kid_id`, `updated_at`) VALUES (?, ?, ?, ?)  [["created_at", "2015-04-24 15:24:53"], ["date", "2015-04-24 00:00:00"], ["kid_id", 10], ["updated_at", "2015-04-24 15:24:53"]]
UPDATE `kids` SET `is_checked_in` = ?, `updated_at` = ? WHERE `kids`.`id` = 10  [["is_checked_in", 1], ["updated_at", "2015-04-24 15:24:53"]]
---
  def checkin
    ids = params[:ids]
    successfulCheckins = 0
    now = DateTime.parse(Date.today.to_s)

    ids.each do |id|
      kid = Kid.find(id)
      kid.is_checked_in = true
      Attendance.create(:date => now, :kid_id => id)
      successfulCheckins+=1 if kid.save

SELECT  `kids`.* FROM `kids`  WHERE `kids`.`id` = ? LIMIT 1  [["id", 13]]
---
    def set_kid
      @kid = Kid.find(params[:id])