app/controllers/other_queries_controller.rb

  def index
    @kids = Kid.all
---
SELECT `kids`.* FROM `kids`