app/controllers/parent_controller.rb

  def index
    @parents = Parent.all
---
SELECT `parents`.* FROM `parents`

  def show
		@parent = Parent.find(params[:id])
---
SELECT  `parents`.* FROM `parents`  WHERE `parents`.`id` = ? LIMIT 1  [["id", 12]]

	def edit
		@parent = Parent.find(params[:id])
---
SELECT  `parents`.* FROM `parents`  WHERE `parents`.`id` = ? LIMIT 1  [["id", 12]]

  def create
    @parent = Parent.new(parent_params)
    @kid_in_progress=params[:kid_in_progress]

      if @parent.save
---
INSERT INTO `parents` (`created_at`, `email`, `f_name`, `l_name`, `m_name`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-04-24 16:12:11"], ["email", ""], ["f_name", ""], ["l_name", ""], ["m_name", ""], ["updated_at", "2015-04-24 16:12:11"]]

  def find_by_name
    query = '%'+params[:query]+'%'

    parents_found = Parent.where("f_name LIKE ? OR l_name LIKE ? OR CONCAT(f_name,' ',l_name) LIKE ?", query, query, query)
---
SELECT `parents`.* FROM `parents`  WHERE (f_name LIKE '%n%' OR l_name LIKE '%n%' OR CONCAT(f_name,' ',l_name) LIKE '%n%')

  def get_all_kids
    render json: Parent.find(params[:id]).kids
---
SELECT  `parents`.* FROM `parents`  WHERE `parents`.`id` = ? LIMIT 1  [["id", 6]]
SELECT `kids`.* FROM `kids` INNER JOIN `families` ON `kids`.`id` = `families`.`kid_id` WHERE `families`.`parent_id` = ?  [["parent_id", 6]]