app/views/kid/_form.html.erb

	</br>
		<%= select_tag(:parent, options_from_collection_for_select(Parent.all, :id, :f_name) ) %>
---
SELECT `parents`.* FROM `parents`

	</br>
		<%= select_tag(:allergy, options_from_collection_for_select(Allergy.all, :id, :name) ) %>
---
SELECT `allergies`.* FROM `allergies`