app/views/kid/edit_parents.html.erb

		<tbody>
			<% @kid.parents.each do |f| %>
---
SELECT `parents`.* FROM `parents` INNER JOIN `families` ON `parents`.`id` = `families`.`parent_id` WHERE `families`.`kid_id` = ?  [["kid_id", 13]]

		<tbody>
			<% @kid.families.each do |f| %>
				<tr>
						<td><%= Parent.find_by(id: f.parent_id).f_name %></td>
---
SELECT `families`.* FROM `families`  WHERE `families`.`kid_id` = ?  [["kid_id", 13]]
SELECT  `parents`.* FROM `parents`  WHERE `parents`.`id` = 6 LIMIT 1