app/views/kid/show.html.erb

		<td>
			<% @kid.parents.each do |f| %>
---
SELECT `parents`.* FROM `parents` INNER JOIN `families` ON `parents`.`id` = `families`.`parent_id` WHERE `families`.`kid_id` = ?  [["kid_id", 4]]

		<td>
			<% Allergic.where(:kid_id => @kid.id).each do |a| %>
				<%= Allergy.find_by(id: a.allergy_id).name%>
---
SELECT `allergics`.* FROM `allergics`  WHERE `allergics`.`kid_id` = 4
SELECT  `allergies`.* FROM `allergies`  WHERE `allergies`.`id` = 1 LIMIT 1